cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/services"

# Code
brew "mas"
brew "starship"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "pnpm"
# brew "z"

# Apps
cask "hyper"
cask "visual-studio-code"
cask "firefox"
cask "arc"
cask "notion"
cask "figma"
cask "alfred"
cask "spotify"
cask "ngrok"
cask "nordvpn"

# App store
mas "Xcode", id: 497799835
mas "Numbers", id: 409203825
mas "Slack", id: 803453959