cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/services"

# Code
brew "mas"
# doesn't work with ohmyzsh
# brew "starship"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "pnpm"
brew "nvm"
brew "zsh"
brew "exa"
brew "fx"
# brew "z"

# Apps
cask "hyper"
cask "visual-studio-code"
cask "firefox"
cask "arc"
cask "notion"
cask "figma"
# cask "alfred"
cask "spotify"
cask "ngrok"
# cask "nordvpn"
cask "dropbox"

# App store
mas "Xcode", id: 497799835
mas "Numbers", id: 409203825
mas "Slack", id: 803453959